# Taps
tap "azure/kubelogin"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "idoavrah/homebrew"
tap "jorgerojas26/lazysql"
tap "julien-cpsn/atac"
tap "nikitabobko/tap"
tap "Valkyrie00/homebrew-bbrew"

# Brew Packages (CLI)
brew "argocd"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bat"
brew "bottom"
brew "bbrew"
brew "carapace"
brew "cloudflare/cloudflare/cf-terraforming"
brew "direnv"
brew "duf"
brew "eza"
brew "fd"
brew "flarectl"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "helmfile"
brew "idoavrah/homebrew/tftui"
brew "ipcalc"
brew "jq"
brew "julien-cpsn/atac/atac"
brew "k9s"
brew "kubecm"
brew "kubernetes-cli"
brew "ktop"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lua"
brew "neovim"
brew "node"
brew "nushell"
brew "podman"
brew "postgresql"
brew "pre-commit"
brew "python"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tenv"
brew "terraform-docs"
brew "tldr"
brew "typescript"
brew "xclip" #Mac should ignore
brew "yank"
brew "yarn"
brew "yazi"
brew "zoxide"

# Emacs & Language Servers
brew "bash-language-server"
brew "emacs-plus@30", args: ["with-native-comp"]
brew "terraform-ls"
brew "tflint"
brew "yaml-language-server"

# macOS (Casks)
if OS.mac?
  cask "alfred"
  cask "caffeine"
  cask "cloudflare-warp"
  cask "font-fira-code-nerd-font"
  cask "font-hack-nerd-font"
  cask "ghostty"
  cask "hammerspoon"
  cask "insomnia"
  cask "microsoft-office"
  cask "neovide-app"
  cask "pgadmin4"
  cask "podman-desktop"
  cask "postman"
  cask "sanesidebuttons"
  cask "slack"
  cask "spotify"
  cask "warp"
  cask "zed"
  cask "zen"
  cask "zoom"
end

# Linux (shared desktop apps, plus Steam/Lutris unless Bazzite)
def bazzite?
  return false unless OS.linux?
  File.exist?("/etc/os-release") && File.read("/etc/os-release").include?("Bazzite")
end

if OS.linux?
  flatpak "app.ghostty.Ghostty"
  flatpak "com.discordapp.Discord"
  flatpak "com.rtosta.zapzap"
  flatpak "com.spotify.Client"
  flatpak "org.gnome.Evolution"
  flatpak "org.onlyoffice.desktopeditors"
  flatpak "org.mozilla.firefox"
  flatpak "org.signal.Signal"
  flatpak "org.openrgb.OpenRGB"

  unless bazzite?
    flatpak "com.valvesoftware.Steam"
    flatpak "net.lutris.Lutris"
  end
end
