# Taps
tap "azure/kubelogin"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "idoavrah/homebrew"
tap "julien-cpsn/atac"
tap "mk-5/mk-5"
tap "nikitabobko/tap"
tap "vladimirvivien/oss-tools"
tap "jorgerojas26/lazysql"

# Brew Packages
brew "argocd"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bat"
brew "carapace"
brew "cloudflare/cloudflare/cf-terraforming"
brew "cloudflare/cloudflare/flarectl"
brew "direnv"
brew "duf"
brew "eza"
brew "fzf"
brew "gh"
brew "glances"
brew "go"
brew "helm"
brew "helmfile"
brew "htop"
brew "idoavrah/homebrew/tftui"
brew "ipcalc"
brew "jq"
brew "julien-cpsn/atac/atac"
brew "k9s"
brew "kubecm"
brew "kubectl"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lua"
brew "mk-5/mk-5/fjira"
brew "neovim"
brew "nodejs"
brew "nushell"
#brew "opentofu"
brew "python"
brew "postgresql"
brew "pre-commit"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
#brew "terraform"
brew "tenv" #this manages terraform and tofu versions for you
brew "terraform-docs"
brew "tldr"
brew "typescript"
brew "vladimirvivien/oss-tools/ktop"
brew "yank"
brew "yarn"
brew "yazi"

# Casks
cask "alfred"
cask "caffeine"
cask "cloudflare-warp"
cask "docker"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "ghostty"
cask "insomnia"
cask "microsoft-office"
cask "postman"
cask "sanesidebuttons"
cask "slack"
cask "spotify"
cask "warp"
cask "zen"
