################################################################################
# Brewfile - organized per OS.
#
#   Sections:  1) SHARED CLI    2) macOS only    3) Linux only
#
#   Linux GUI apps, gaming, and Ghostty are handled outside brew bundle:
#     flatpaks         -> .config/scripts/flatpak_setup.zsh
#     flatpaks-gaming  -> .config/scripts/gaming_setup.zsh
#     ghostty          -> .config/scripts/ghostty_setup.zsh
################################################################################


################################################################################
# 1) SHARED CLI  (macOS + Bazzite + Silverblue)
################################################################################

# Taps
tap "argoproj/tap"
tap "azure/kubelogin"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "idoavrah/homebrew"
tap "jorgerojas26/lazysql"
tap "julien-cpsn/atac"
tap "Valkyrie00/homebrew-bbrew"

# Core
brew "argocd"
brew "bat"
brew "bottom"
brew "bbrew"
brew "carapace"
brew "cloudflare/cloudflare/cf-terraforming"
brew "direnv"
brew "duf"
brew "eza"
brew "fd"
brew "flarectl"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "helmfile"
brew "idoavrah/homebrew/tftui"
brew "ipcalc"
brew "jq"
brew "julien-cpsn/atac/atac"
brew "k9s"
brew "kubecm"
brew "kubernetes-cli"
brew "ktop"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lua"
brew "neovim"
brew "node"
brew "nushell"
brew "podman"
brew "postgresql"
brew "pre-commit"
brew "python"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tenv"
brew "terraform-docs"
brew "tldr"
brew "typescript"
brew "yank"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh"

# Cloud CLIs & scripting
brew "awscli"
brew "aws-vault"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "powershell"
brew "uv"
brew "pipx"

# Linters & formatters
brew "ruff"
brew "shellcheck"
brew "tflint"

# Language servers
brew "bash-language-server"
brew "pyright"
brew "terraform-ls"
brew "yaml-language-server"

# k9s / Kubernetes plugins
brew "argoproj/tap/kubectl-argo-rollouts"
brew "dive"
brew "krew"
brew "stern"


################################################################################
# 2) macOS only
################################################################################
if OS.mac?
  tap "d12frosted/emacs-plus"
  tap "nikitabobko/tap"

  brew "emacs-plus@30", args: ["with-native-comp"]

  # Fonts
  cask "font-fira-code-nerd-font"
  cask "font-hack-nerd-font"

  # GUI apps (parity with flatpaks)
  cask "discord"
  cask "ghostty"
  cask "insomnia"
  cask "neovide-app"
  cask "pgadmin4"
  cask "podman-desktop"
  cask "postman"
  cask "slack"
  cask "spotify"
  cask "warp"
  cask "zed"
  cask "zen"
  cask "zoom"
  cask "firefox"
  cask "microsoft-office"
  # cask "cloudflare-warp"
end


################################################################################
# 3) Linux only  (Bazzite + Silverblue)
################################################################################
if OS.linux?
  brew "emacs"
  brew "wl-clipboard"
  brew "xclip"
end
